

def parse_txt_prompt(text, comment):
    prompt = f"""
    Діяй як професійний парсер і спеціаліст з продажу автомобільних акумуляторів.

!!! САМЕ ГОЛОВНЕ спочатку зрозумій чи є даний товар акумулятором, і якщо ні то пропусти його

З цього TXT-фрагменту повністю витягни дані про акумулятори та перетвори їх у масив JSON об'єктів такого формату:
{{
  "brand": brand,
  "volume": volume,
  "full_name": full_name,
  "price": price,
  "c_amps": c_amps,
  "region": region,
  "polarity": polarity,
  "electrolyte": electrolyte
}}

📌 Деталі парсингу:
- 'brand': поверни назву бренду одним словом
- `price`: найменший оптовий (якщо неможкш знайти то null)
- `full_name`: повна назва акумулятора 
- `c_amps`: пусковий струм(якщо немає то null)
- `region`: за замовчуванням EUROPE, якщо є "ASIA", то ASIA (це є тип корпусу)
- `polarity`: у форматі R+ або L+ (в залежності з якої сторони +(якщо пише (-/+) то це R+)))
- `electrolyte`: AGM, GEL, або LAB (якщо не вказаний)
- `volume`: ємність в Ah (в деяких випадках ємність може позначатись на укр/рос мові типу АГ, АЧ, Аг, Ач, аг, ач)
{comment if comment else ""}


Ось дані:
{text}

❗️Поверни лише чистий JSON у відповідь. Без зайвого тексту.
"""
    return prompt